// c语言实现堆排序的运用
// topk问题
#include <stdio.h>

void sift(int *list, int low, int high)
{
    int i = low;
    int j = 2 * i +1;
    int temp = list[low];
    while (j <= high)
    {
        if (j + 1 <= high && list[j + 1] < list[j])
        {
            j += 1;
        }
        if (temp > list[j])//注意这里要和下一个比较
        {
            list[i] = list[j];
            i = j;
            j = 2 * i + 1;
        }
        else
            break;
    }
    list[i] = temp;
}



void  topk(int *list, int *heap, int k)
{
    int n = 0; // n就是数组的长度
    int *_ = list ; 
    while (*_)
    {
        _++;
        n++;
    }

    for (int i = (k - 2)/ 2; i >= 0; i--)
    {
        sift(heap, i, k - 1);
    } //建立堆

    for (int i = k; i < n ; i++)
    {
        if (list[i] > heap[0])
        {
            heap[0] = list[i];
            sift(heap, 0, k - 1);
        }
    } //挨个遍历

    for (int i = k - 1; i >= 0; i--)
    {
        int temp = heap[0];
        heap[0] = heap[i];
        heap[i] = temp;
        sift(heap, 0, i - 1);
    }//heap堆排序
}

int main()
{
    int list[1000] = {786, 241, 105, 981, 239, 98, 90, 265, 495, 309, 611, 52, 371, 960, 490, 331, 618, 631, 57, 989, 574, 497, 662, 763, 333, 681, 677, 984, 471, 828, 915, 31, 845, 493, 719, 398, 642, 892, 976, 228, 161, 752, 317, 123, 359, 873, 705, 996, 297, 304, 637, 509, 177, 605, 282, 592, 73, 979, 375, 917, 885, 28, 212, 555, 576, 361, 378, 88, 117, 340, 600, 410, 769, 781, 195, 286, 934, 330, 109, 35, 427, 456, 50, 181, 226, 749, 233, 657, 142, 776, 675, 67, 757, 436, 267, 654, 682, 796, 145, 505, 118, 77, 143, 712, 683, 178, 447, 438, 136, 342, 852, 840, 848, 906, 29, 743, 180, 927, 978, 992, 147, 494, 782, 898, 695, 222, 164, 947, 130, 616, 707, 750, 13, 225, 204, 909, 481, 91, 655, 55, 543, 964, 575, 931, 504, 899, 498, 383, 104, 858, 999, 174, 279, 65, 715, 673, 60, 700, 563, 261, 742, 943, 835, 30};
    int heap[10] = {0};
    for (int i = 0; i < 10; i++)
    {
        heap[i] = list[i];
    }//建立切片

    topk(list, heap, 10);
    for (int i = 0; i < 10; i++)
    {
        printf("%d ", heap[i]);
    }
}